lvx/base/InformationRegisters/бит_Удалить_СтатьиОборотов_СтатьиРегл.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_Удалить_СтатьиОборотов_СтатьиРегл</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Comment>Статья оборотов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРегл</Name>
					<Comment>Статья регламентированного учета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчетаБУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_Удалить_СтатьиОборотов_СтатьиРегл/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда		
		ТекстСообщения = НСтр("ru='Объект не используется в данной версии программы.';
							  |en='The object is not used in this version.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);		
		СтандартнаяОбработка = Ложь;		
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МассивТипов = Метаданные.РегистрыСведений.бит_Удалить_СтатьиОборотов_СтатьиРегл.Измерения.СтатьяРегл.Тип.Типы();
	СписокРез = бит_ОбщегоНазначения.ПодготовитьСписокВыбораТипа(МассивТипов);
	Для каждого Элемент Из СписокРез Цикл	
		СписокТиповСтатьяРегл.Добавить(Элемент.Значение, Элемент.Представление);	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатьяРеглНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект,
	                  Элемент, Запись, "СтатьяРегл", СписокТиповСтатьяРегл, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяРеглПриИзменении(Элемент)
	
	Если ТипЗнч(Запись.СтатьяРегл) <> Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
		
		Запись.СчетУчетаБУ = Неопределено;
		
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяРеглОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Если ТипЗнч(Запись.СтатьяРегл) = Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
		Элементы.СчетУчетаБУ.Доступность = Истина;
	Иначе
		Элементы.СчетУчетаБУ.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
